{
  "courses": {
    "MBA Accounting and Finance": {
      "modules": {
        "Finance for Business Leaders": {
          "lessons": {
            "U1C1L1": {
              "title": "Glossary of Accounting Terms",
              "terms": {
                "Accounting": "A systematic process of identifying, recording, classifying, analyzing, and communicating financial information of a business.",
                "Financial Transactions": "Business activities involving money that can be measured and recorded, such as sales, purchases, payments, and receipts.",
                "Bookkeeping": "The process of recording financial transactions in a systematic manner in accounting books.",
                "Profit": "The excess of income over expenses during a specific accounting period.",
                "Loss": "The excess of expenses over income during a specific accounting period.",
                "Assets": "Resources owned by a business that have economic value, such as cash, inventory, buildings, and machinery.",
                "Liabilities": "Obligations or debts of a business payable to outsiders, such as loans, creditors, and outstanding expenses.",
                "Financial Position": "The overall economic condition of a business at a particular point in time, shown through assets and liabilities.",
                "Financial Statements": "Structured reports presenting financial information, such as the Balance Sheet, Income Statement, and Cash Flow Statement.",
                "Balance Sheet": "A financial statement that shows the assets, liabilities, and capital of a business on a specific date.",
                "Income Statement": "A financial statement that shows revenues, expenses, and profit or loss for a specific accounting period.",
                "Cash Flow Statement": "A statement showing inflows and outflows of cash during a particular period.",
                "Liquidity": "The ability of a business to meet its short-term financial obligations.",
                "Working Capital": "The excess of current assets over current liabilities, indicating short-term financial health.",
                "Cash Flow Management": "The process of planning and controlling cash inflows and outflows to maintain liquidity.",
                "Statutory Compliance": "Adherence to legal and regulatory accounting requirements prescribed by law.",
                "Budget": "A financial plan estimating future income and expenditure for a specific period.",
                "Financial Performance": "A measure of how effectively a business uses its resources to generate profit."
              }
            }
          }
        }
      }
    }
  }
}
